# DAY-3 TASKS

# Task 1: Pandas Basics

• Create a Series and a DataFrame from scratch
• Use .head(), .tail(), .shape, .columns, .index, .dtypes to inspect structure

In [2]:
import pandas as pd

C:\Users\HPW\anaconda3\lib\site-packages\pandas\core\arrays\masked.py:61: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

A Series is a one-dimensional labeled array capable of holding data of any type (integers, strings, floats, etc.).
Each value in a Series has a label, called the index.

In [ ]:
#creating series

In [8]:
series=pd.Series([10,20,30,40,50,60,70,80,90,100,110,120,130])

In [9]:
series

0      10
1      20
2      30
3      40
4      50
5      60
6      70
7      80
8      90
9     100
10    110
11    120
12    130
dtype: int64

In [10]:
series.head()#head() – Returns the first 5 rows of the Series/DataFrame.

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [11]:
series.tail()#tail() – Returns the last 5 rows of the Series/DataFrame.

8      90
9     100
10    110
11    120
12    130
dtype: int64

In [13]:
series.shape#shape – Returns a tuple representing the dimensions (rows, columns).

(13,)

In [14]:
series.index#index – Returns the index (row labels) of the Series/DataFrame.

RangeIndex(start=0, stop=13, step=1)

In [15]:
series.dtypes#dtypes – Returns the data types of each column in the DataFrame.

dtype('int64')

A DataFrame is a two-dimensional labeled data structure with columns that can be of different types.
It is like a table (similar to an Excel sheet or SQL table), where rows and columns both have labels (index and column names).

In [16]:
#creating a dataframe

In [17]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [24, 27, 22, 32, 29],
    "City": ["Pune", "Mumbai", "Delhi", "Bangalore", "Chennai"]
}
df=pd.DataFrame(data)

In [18]:
df

      Name  Age       City
0    Alice   24       Pune
1      Bob   27     Mumbai
2  Charlie   22      Delhi
3    David   32  Bangalore
4      Eva   29    Chennai

In [19]:
df.head(2)#head() – Returns the first 2 rows of the Series/DataFrame.

    Name  Age    City
0  Alice   24    Pune
1    Bob   27  Mumbai

In [20]:
df.tail(3)#tail() – Returns the last 3 rows of the Series/DataFrame.

      Name  Age       City
2  Charlie   22      Delhi
3    David   32  Bangalore
4      Eva   29    Chennai

In [21]:
df.shape#shape – Returns a tuple representing the dimensions (rows, columns).

(5, 3)

In [22]:
df.dtypes#dtypes – Returns the data types of each column in the DataFrame.

Name    object
Age      int64
City    object
dtype: object

In [23]:
df.columns# Returns the column labels of the DataFrame.

Index(['Name', 'Age', 'City'], dtype='object')

# Task 2: Load and View Data


• Load a CSV using pd.read_csv()
• Explore using .info(), .describe(), and .isnull().sum()
• Identify:
o Nulls
o Data types
o Row and column count

In [26]:
df=pd.read_csv("Titanic-Dataset.csv")

In [27]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [29]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [30]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [32]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [33]:
df.shape

(891, 12)

In [34]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# Task 3: Access & Filter Data

In [ ]:

• Use:
o df['column'] and df[['col1', 'col2']]
o df.loc[], df.iloc[]
• Add a new column (e.g., calculated metric)
• Drop a column or a row

In [36]:
df['Age']  # returns a Series

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [37]:
df[['Ticket', 'Fare']]  # returns a DataFrame

               Ticket     Fare
0           A/5 21171   7.2500
1            PC 17599  71.2833
2    STON/O2. 3101282   7.9250
3              113803  53.1000
4              373450   8.0500
..                ...      ...
886            211536  13.0000
887            112053  30.0000
888        W./C. 6607  23.4500
889            111369  30.0000
890            370376   7.7500

[891 rows x 2 columns]

In [40]:
df.iloc[1]# row at position 1

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                         38.0
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 1, dtype: object

In [41]:
df.iloc[2, 1]     # value at row 2, column 1

1

In [42]:
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [44]:
df['FamilySize'] = df['SibSp'] + df['Parch'] + 1
df['FarePerPerson'] = df['Fare'] / df['FamilySize']

In [45]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,FarePerPerson
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,3.62500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,35.64165
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,7.92500
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,26.55000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,8.05000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,13.00000
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,30.00000
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,5.86250
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,30.00000
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,7.75000

In [46]:
df.drop(2, axis=0, inplace=True)  # drops row with index 2

# Task 4: Built-in Methods


• Practice with:
o .sort_values(), .value_counts(), .unique()
o .mean(), .sum(), .min(), .max()
• Use Markdown or comments to explain what each line does

In [47]:
df.sort_values(by="Age")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,FarePerPerson
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C,2,4.258350
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S,3,4.833333
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C,4,4.814575
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C,4,4.814575
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S,3,6.250000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C,1,7.229200
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S,11,6.322727
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S,1,9.500000
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S,1,7.895800
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,5.862500

In [48]:
# Sort by Fare descending
df.sort_values(by='Fare', ascending=False, inplace=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,FarePerPerson
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C,1,512.329200
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C,2,256.164600
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C,1,512.329200
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S,6,43.833333
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S,6,43.833333
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0000,NaN,S,1,0.000000
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0000,NaN,S,1,0.000000
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S,1,0.000000
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0000,NaN,S,1,0.000000
674,675,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0000,NaN,S,1,0.000000

In [49]:
# Count of each class
df['Pclass'].value_counts()

Pclass
3    490
1    216
2    184
Name: count, dtype: int64

In [50]:
# Count of each gender
df['Sex'].value_counts()

Sex
male      577
female    313
Name: count, dtype: int64

In [53]:
df["Sex"].unique()

array(['male', 'female'], dtype=object)

In [54]:
# Unique embarkation points
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [55]:
# Unique ticket classes
df['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [56]:
# Descriptive stats

In [57]:
# Mean age
df['Age'].mean()

29.704305750350628

In [58]:
# Total fare collected
df['Fare'].sum()

28686.024299999997

In [59]:
# Minimum fare
df['Fare'].min()

0.0

In [60]:
# Maximum age
df['Age'].max()

80.0

In [61]:
# What's the average fare by class?
df.groupby('Pclass')['Fare'].mean()

Pclass
1    84.154687
2    20.662183
3    13.687286
Name: Fare, dtype: float64

In [62]:
# Count of survivors vs. non-survivors
df['Survived'].value_counts()

Survived
0    549
1    341
Name: count, dtype: int64